tap "adoptopenjdk/openjdk"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
brew "openssl@1.1"
brew "csvkit"
brew "go"
brew "helm"
brew "jq"
brew "libpcap"
brew "protobuf"
brew "mysql"
brew "neovim"
brew "nmap"
brew "protoc-gen-go"
brew "pv"
brew "python"
brew "snappy"
brew "starship"
brew "stow"
brew "telnet"
brew "tmux"
brew "vim"
brew "yarn"
cask "adoptopenjdk"
cask "adoptopenjdk11"
cask "adoptopenjdk12"
cask "adoptopenjdk8"
cask "alacritty"
cask "alfred"
cask "caffeine"
cask "choosy"
cask "docker"
cask "firefox"
cask "font-firacode-nerd-font"
cask "fsnotes"
cask "google-chrome"
cask "google-cloud-sdk"
cask "jetbrains-toolbox"
cask "spotify"
cask "visual-studio-code"
cask "webex-meetings"
cask "wireshark"
cask "zoomus"
