tap "adoptopenjdk/openjdk"
tap "golangci/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/core"
# Cryptography and SSL/TLS Toolkit
brew "openssl@1.1"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Official Amazon AWS command-line interface
brew "awscli"
# Google's own build tool
brew "bazel"
# (Arguably) the best yacc variant
brew "byacc"
# Formatting tools for C, C++, Obj-C, Java, JavaScript, TypeScript
brew "clang-format"
# Cross-platform make
brew "cmake"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Suite of command-line tools for converting to and working with CSV
brew "csvkit"
# Convert text between DOS, UNIX, and Mac formats
brew "dos2unix"
# Generate C code to parse command-line arguments via getopt_long
brew "gengetopt"
# GNU internationalization (i18n) and localization (l10n) library
brew "gettext"
# GNU multiple precision arithmetic library
brew "gmp"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Protocol buffers (Google's data interchange format)
brew "protobuf"
# Next generation open source RPC library and framework
brew "grpc"
# Configurable static site generator
brew "hugo"
# Lightweight and flexible command-line JSON processor
brew "jq"
# JSON parser for C
brew "json-c"
# DNS library written in C
brew "ldns"
# Portable low-level networking library
brew "libdnet"
# Asynchronous event library
brew "libevent"
# Portable Foreign Function Interface library
brew "libffi"
# C string library for manipulating Unicode strings
brew "libunistring"
# Mac App Store command-line interface
brew "mas"
# Open source relational database management system
brew "mysql"
# Manage compile and link flags for libraries
brew "pkg-config"
# Interpreted, interactive, object-oriented programming language
brew "python@2", link: false
# Powerful, clean, object-oriented scripting language
brew "ruby"
# Low-level access to audio, keyboard, mouse, joystick, and graphics
brew "sdl2"
# Compression/decompression library aiming for high speed
brew "snappy"
# Cross-shell prompt for astronauts
brew "starship"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Terminal multiplexer
brew "tmux"
# Vi 'workalike' with many additional features
brew "vim"
# Internet file retriever
brew "wget"
# JavaScript package manager
brew "yarn"
# Fast linters runner for Go.
brew "golangci/tap/golangci-lint"
cask "adoptopenjdk11"
cask "alacritty"
cask "alfred"
cask "caffeine"
cask "choosy"
cask "discord"
cask "docker"
cask "firefox"
cask "font-fira-code"
cask "google-chrome"
cask "google-cloud-sdk"
cask "jetbrains-toolbox"
cask "mactex"
cask "typora"
cask "visual-studio-code"
cask "wireshark"
mas "1Password", id: 443987910
mas "iMovie", id: 408981434
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Pomo Timer", id: 1447569061
mas "Poolside FM", id: 1514817810
mas "Slack", id: 803453959
mas "Xcode", id: 497799835
